Revit 2027 API
DuctPressureDropData.WidthOrDiameter Property
 The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WidthOrDiameter { get; }
Public ReadOnly Property WidthOrDiameter As Double
	Get
public:
property double WidthOrDiameter {
	double get ();
}
member WidthOrDiameter : float with get
Property Value
Double
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace